{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8bc8ddc6-ef94-440d-8b31-1b73c8a476c0')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8bc8ddc6-ef94-440d-8b31-1b73c8a476c0')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Bitsadmin Activity - [WC-BASE]",
                                             "description":  "Background Intelligent Transfer Service (BITS) is a way to reliably download files from webservers or SMB servers. Bitsadmin can be used to upload files and therefore can be used for data exfiltration. This query will identify use of bitsadmin.exe for either purpose and will identify directionality file transfer.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "DeviceProcessEvents\r\n| where \r\n    (FileName =~ \"bitsadmin.exe\" or column_ifexists('ProcessVersionInfoOriginalFileName','ColumnNotAvailable') =~ 'bitsadmin.exe')\r\n    and ProcessCommandLine has_any ('/Transfer','/AddFile', '/AddFileSet','/AddFileWithRanges')\r\n| extend \r\n    ParsedCommandLine = parse_command_line(ProcessCommandLine,'windows')\r\n| extend     \r\n    RemoteUrl = tostring(ParsedCommandLine[-2]),\r\n    LocalFile= tostring(ParsedCommandLine[-1]),\r\n    Direction = iff(ProcessCommandLine has \"/Upload\", 'Upload', 'Download')\r\n| project-reorder \r\n    TimeGenerated,\r\n    DeviceId,\r\n    DeviceName,\r\n    Direction,\r\n    RemoteUrl,\r\n    LocalFile,\r\n    InitiatingProcessFolderPath,\r\n    InitiatingProcessAccountDomain,\r\n    InitiatingProcessAccountName,\r\n    InitiatingProcessSHA256,\r\n    ProcessId,\r\n    ProcessCommandLine\r\n| extend HostName = iff(DeviceName has '.', substring(DeviceName, 0, indexof(DeviceName, '.')), DeviceName)\r\n| extend DnsDomain = iff(DeviceName has '.', substring(DeviceName, indexof(DeviceName, '.') + 1), \"\")",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "DefenseEvasion",
                                                             "Persistence"
                                                         ],
                                             "techniques":  [
                                                                "T1197"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "ProcessName":  "FileName"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Process",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "CommandLine",
                                                                                                  "columnName":  "ProcessCommandLine"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}