{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/414ca679-d6f1-4176-8a18-f8d3b15f6d54')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/414ca679-d6f1-4176-8a18-f8d3b15f6d54')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Detected Exfiltration After Termination - [WC-BASE]",
                                             "description":  "This query can be used to explore any instances where a terminated individual (i.e. one who has an impending termination date but has not left the company) downloads a large number of files from a non-Domain network address.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let GetTerminatedUsers = IdentityInfo\n| where TimeGenerated \u003e ago(14d)\n| where IsAccountEnabled != true\n| distinct AccountUPN;\nDeviceNetworkEvents\n| join \n    DeviceFileEvents\n    on InitiatingProcessAccountUpn\n    | where ActionType1 == \"FileCreated\"\n| where FileName endswith \".docx\"\n    or FileName endswith \".pptx\"\n    or FileName endswith \".xlsx\"\n    or FileName endswith \".pdf\"\n| join DeviceNetworkInfo on DeviceId\n| where ConnectedNetworks !contains '\"Category\":\"Domain\"'  //Looking for remote, non-domain networks\n| where TimeGenerated \u003e ago(1h)\n| summarize TotalFiles=dcount(FileName) by InitiatingProcessAccountUpn,DeviceName\n| where TotalFiles \u003e 1000 // adjust accordingly\n| join kind=inner GetTerminatedUsers on $left.InitiatingProcessAccountUpn == $right.AccountUPN",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Exfiltration"
                                                         ],
                                             "techniques":  [
                                                                "T1029"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "AccountUPN"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}