{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/84d2fbad-ec37-41cf-a3ca-184b0354e96b')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/84d2fbad-ec37-41cf-a3ca-184b0354e96b')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Explicit Content-Based of watchlist - [WC-BASE] ",
                                             "description":  "The rule is tailored to look for explicit content on a user's device based on a watchlist.",
                                             "severity":  "Informational",
                                             "enabled":  true,
                                             "query":  "let watchlist = (_GetWatchlist(\"Explicit_word\")| project SearchKey);\r\nunion DeviceFileEvents, DeviceEvents\r\n| where FileName has_any (watchlist) or PreviousFileName has_any (watchlist) or FolderPath has_any (watchlist) \r\n| where FileName contains \".avi\" or FileName contains \".flv\" or FileName contains \".gif \" or FileName contains \".gifv \" or FileName contains \".wmv\" or FileName contains \".rm\" or FileName contains \".mp4\" or FileName contains \".mpg\" or FileName contains \".jpg\" or FileName contains \".png\" or FileName contains \".vlc\"  or FileName contains \".xhtml\" or FileName contains \".html\" or FileName contains \".htm\" or FileName contains \".tmp\" or FileName contains \".m4v\" or FileName contains \".mov\" or FileName contains \".mkv\" or FileName contains \".lnk\" or FileName contains \".MPG\"\r\n|project TimeGenerated,FileName, PreviousFileName, DeviceName, FolderPath",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Collection"
                                                         ],
                                             "techniques":  [
                                                                "T1560"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {

                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "File",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "FileName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}