{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b3e10170-1ae9-4534-a664-8352db108b49')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b3e10170-1ae9-4534-a664-8352db108b49')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Failed Brute Force on Exchange Online - [WC-BASE]",
                                             "description":  "This rule looks for failed brute force attacks on Office 365 Exchange Online.",
                                             "severity":  "Informational",
                                             "enabled":  true,
                                             "query":  "let IncorrectPWBruteForceUsers = SigninLogs\r\n| where ResultType == 50126\r\n| where AppDisplayName == \"Office 365 Exchange Online\"\r\n| summarize count() by UserPrincipalName\r\n| where count_ \u003e= 2;\r\nlet IncorrectPW = SigninLogs\r\n| join kind=inner IncorrectPWBruteForceUsers on UserPrincipalName\r\n| where ResultType == 50126\r\n| where AppDisplayName == \"Office 365 Exchange Online\"\r\n| summarize min(TimeGenerated),max(TimeGenerated),IPAddresses = make_set(IPAddress), Locations = make_set(Location),Results = make_set(ResultDescription) by  UserPrincipalName;\r\nSigninLogs\r\n| where ResultType == 50053\r\n| where AppDisplayName == \"Office 365 Exchange Online\"\r\n| summarize min(TimeGenerated),max(TimeGenerated),IPAddresses = make_set(IPAddress), Locations = make_set(Location),Results = make_set(ResultDescription) by  UserPrincipalName\r\n| union IncorrectPW",
                                             "queryFrequency":  "P1D",
                                             "queryPeriod":  "P1D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "CredentialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1110"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  {
                                                                          "alertDynamicProperties":  [

                                                                                                     ]
                                                                      },
                                             "customDetails":  {

                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "UserPrincipalName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}