{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/95bb98cb-3521-4a61-af28-ba0ed8af5c39\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/95bb98cb-3521-4a61-af28-ba0ed8af5c39\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Local domain group enumeration via CrackMapExec - [WC-BASE]",
                                             "description":  "Detects scenarios where an attacker attempts to enumerate domain local groups with tools like CME (--local-groups). Source can be identified by correlating TargetLogonId from ID 4624 with SubjectLogonId from ID 4661. Requires extended rights auditing enabled (https://www.manageengine.com/products/active-directory-audit/active-directory-auditing-configuration-guide-configure-object-level-auditing-manually.html)",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let GetEntity = SecurityEvent | where ((EventID == 4661 and ProcessName endswith @\u0027\\lsass.exe\u0027 and ObjectServer =~ \u0027Security Account Manager\u0027 and ObjectType =~ \u0027SAM_ALIAS\u0027 and (ObjectName startswith \u0027S-1-5-32-\u0027 or ObjectName startswith \u0027S-1-5-21-\u0027)) and (SubjectUserName !endswith \u0027$\u0027)) | summarize count() by IpAddress | where count_ \u003e 30;\r\nSecurityEvent\r\n| where ((EventID == 4661 and ProcessName endswith @\u0027\\lsass.exe\u0027 and ObjectServer =~ \u0027Security Account Manager\u0027 and ObjectType =~ \u0027SAM_ALIAS\u0027 and (ObjectName startswith \u0027S-1-5-32-\u0027 or ObjectName startswith \u0027S-1-5-21-\u0027)) and (SubjectUserName !endswith \u0027$\u0027))\r\n| join kind=inner GetEntity on IpAddress",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Discovery"
                                                         ],
                                             "techniques":  [
                                                                "T1615"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "AccountName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "Computer"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IpAddress"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}