{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/e4bfb9e0-02a1-44e7-a656-7b2665023d57\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/e4bfb9e0-02a1-44e7-a656-7b2665023d57\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Log4j Traffic allowed by Firewall - [WC-BASE]",
                                             "description":  "The alert rule was disabled due to too many consecutive failures. Reason: A semantic error occurred while running the query. Try resetting the alert rule by editing and saving it (without changing any settings). This a customer defined alert for Log4j",
                                             "severity":  "High",
                                             "enabled":  true,
                                             "query":  "let IPList = externaldata(IPAddress: string)[@\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Sample%20Data/Feeds/Log4j_IOC_List.csv\"] with (format=\"csv\", ignoreFirstRecord=True);\r\nlet IPRegex = \u0027[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\\\\.[0-9]{1,3}\u0027;\r\n(union isfuzzy=true\r\n    (FortiOSLogs\r\n    | where Message contains \"log4j\"\r\n    | where SourceIP in (IPList) or DestinationIP in (IPList) or Message has_any (IPList)\r\n    | extend MessageIP = extract(IPRegex, 0, Message)\r\n    | extend IPMatch = case(SourceIP in (IPList), \"SourceIP\", DestinationIP in (IPList), \"DestinationIP\", MessageIP in (IPList), \"Message\", \"No Match\")\r\n    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated)\r\n        by\r\n        SourceIP,\r\n        DestinationIP,\r\n        DeviceProduct,\r\n        DeviceAction,\r\n        Message,\r\n        MessageIP,\r\n        Protocol,\r\n        SourcePort,\r\n        DestinationPort,\r\n        DeviceAddress,\r\n        Computer,\r\n        DeviceName,\r\n        IPMatch\r\n        | where DeviceAction =~ \"accept\"\r\n    | extend\r\n        timestamp = StartTime,\r\n        IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP, IPMatch == \"DestinationIP\", DestinationIP, IPMatch == \"Message\", MessageIP, \"No Match\")\r\n    ),\r\n    (OfficeActivity \r\n    | extend SourceIPAddress = ClientIP, Account = UserId\r\n    | where SourceIPAddress in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        IPCustomEntity = SourceIPAddress,\r\n        AccountCustomEntity = Account\r\n    ),\r\n    (Event\r\n    | where Source == \"Microsoft-Windows-Sysmon\"\r\n    | where EventID == 3\r\n    | extend EvData = parse_xml(EventData)\r\n    | extend EventDetail = EvData.DataItem.EventData.Data\r\n    | extend SourceIP = EventDetail.[9].[\"#text\"], DestinationIP = EventDetail.[14].[\"#text\"]\r\n    | where SourceIP in (IPList) or DestinationIP in (IPList)\r\n    | extend IPMatch = case(SourceIP in (IPList), \"SourceIP\", DestinationIP in (IPList), \"DestinationIP\", \"None\")\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        AccountCustomEntity = UserName,\r\n        HostCustomEntity = Computer,\r\n        IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP, IPMatch == \"DestinationIP\", DestinationIP, \"None\")\r\n    ),\r\n    (SigninLogs\r\n    | where isnotempty(IPAddress)\r\n    | where IPAddress in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        AccountCustomEntity = UserPrincipalName,\r\n        IPCustomEntity = IPAddress\r\n    ),\r\n    (AADNonInteractiveUserSignInLogs\r\n    | where isnotempty(IPAddress)\r\n    | where IPAddress in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        AccountCustomEntity = UserPrincipalName,\r\n        IPCustomEntity = IPAddress\r\n    ),\r\n    (W3CIISLog\r\n    | where isnotempty(cIP)\r\n    | where cIP in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        IPCustomEntity = cIP,\r\n        HostCustomEntity = Computer,\r\n        AccountCustomEntity = csUserName\r\n    ),\r\n    (AzureActivity\r\n    | where isnotempty(CallerIpAddress)\r\n    | where CallerIpAddress in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        IPCustomEntity = CallerIpAddress,\r\n        AccountCustomEntity = Caller\r\n    ),\r\n    (\r\n    AWSCloudTrail\r\n    | where isnotempty(SourceIpAddress)\r\n    | where SourceIpAddress in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        IPCustomEntity = SourceIpAddress,\r\n        AccountCustomEntity = UserIdentityUserName\r\n    ), \r\n    ( \r\n    DeviceNetworkEvents\r\n    | where isnotempty(RemoteIP)\r\n    | where RemoteIP in (IPList)\r\n    | extend\r\n        timestamp = TimeGenerated,\r\n        IPCustomEntity = RemoteIP,\r\n        HostCustomEntity = DeviceName\r\n    )\r\n)",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "InitialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1190"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {

                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPCustomEntity"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "ClientIP"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "InitiatingProcessAccountUpn"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "HostName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}