{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/74c07632-2931-435d-bb32-62905d62ce5a\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/74c07632-2931-435d-bb32-62905d62ce5a\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Mass Deletion by a single user - [WC-BASE]",
                                             "description":  "This alert rule identifies when a user has deleted over 100 unique Sharepoint file objects within a 1 hour period. This should be investigated to see if these relate to a user\u0027s personal sharepoint or whether this impacts other shared resources.",
                                             "severity":  "High",
                                             "enabled":  true,
                                             "query":  "let ManagedAttempts = SigninLogs\n| union AADNonInteractiveUserSignInLogs\n| where TimeGenerated \u003e ago(14d)\n| where (tostring(parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring(parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic or DeviceDetail_string contains \"PII Removed\")\n| distinct IPAddress;\nlet MassDeletion = \nOfficeActivity\n| where TimeGenerated \u003e ago(1h)\n| where Operation == \"FileDeletedSecondStageRecycleBin\"\n| where OfficeObjectId !contains \"personal\"\n| extend IPCustomEntity = iff(isempty( ClientIP),ClientIP_,ClientIP)\n| summarize FilesCount = dcount(SourceFileName) by UserId,IPCustomEntity\n| where FilesCount \u003e 100;\nOfficeActivity\n| where TimeGenerated \u003e ago(1h)\n| where Operation == \"FileDeletedSecondStageRecycleBin\"\n| where OfficeObjectId !contains \"personal\"\n| join kind=inner MassDeletion on UserId\n| join kind=leftanti ManagedAttempts on $left.IPCustomEntity == $right.IPAddress\n",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Impact",
                                                             "DefenseEvasion"
                                                         ],
                                             "techniques":  [
                                                                "T1485",
                                                                "T1070"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "FileCount":  "FilesCount"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "UserId"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPCustomEntity"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}