{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/86c17aee-d2b0-4d88-89a2-c9aa9d93cd31\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/86c17aee-d2b0-4d88-89a2-c9aa9d93cd31\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Mass Cloud resource deletions Time Series Anomaly - [WC-BASE]",
                                             "description":  "This query generates the baseline pattern of cloud resource deletions by an individual and generates an anomaly when any unusual spike is detected. These anomalies from unusual or privileged users could be an indication of a cloud infrastructure takedown by an adversary.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let starttime = 14d;\nlet endtime = 1d;\nlet timeframe = 1d;\nlet TotalEventsThreshold = 25;\nlet GetCallerIPs = AzureActivity \n    | where TimeGenerated \u003e startofday(ago(endtime)) \n    | where OperationNameValue endswith \"delete\"\n    | summarize IPAddresses = make_set(CallerIpAddress) by Caller;\nlet TimeSeriesData = AzureActivity \n    | where TimeGenerated between (startofday(ago(starttime)) .. startofday(now())) \n    | where OperationNameValue endswith \"delete\" \n    | project TimeGenerated, Caller \n    | make-series Total = count() on TimeGenerated from startofday(ago(starttime)) to startofday(now()) step timeframe by Caller;\nTimeSeriesData \n| extend (anomalies, score, baseline) = series_decompose_anomalies(Total, 3, -1, \u0027linefit\u0027) \n| mv-expand\n    Total to typeof(double),\n    TimeGenerated to typeof(datetime),\n    anomalies to typeof(double),\n    score to typeof(double),\n    baseline to typeof(long) \n| where TimeGenerated \u003e= startofday(ago(endtime)) \n| where anomalies \u003e 0 \n| project Caller, TimeGenerated, Total, baseline, anomalies, score \n| where Total \u003e TotalEventsThreshold and baseline \u003e 0 \n| join (AzureActivity \n    | where TimeGenerated \u003e startofday(ago(endtime)) \n    | where OperationNameValue endswith \"delete\" \n    | summarize count(), make_set(OperationNameValue, 100), make_set(_ResourceId, 100) by bin(TimeGenerated, timeframe), Caller)\n    on TimeGenerated, Caller \n| extend Name = iif(Caller has \u0027@\u0027, tostring(split(Caller, \u0027@\u0027, 0)[0]), \"\")\n| extend UPNSuffix = iif(Caller has \u0027@\u0027, tostring(split(Caller, \u0027@\u0027, 1)[0]), \"\")\n| extend AadUserId = iif(Caller !has \u0027@\u0027, Caller, \"\")\n| join kind=leftouter GetCallerIPs on Caller",
                                             "queryFrequency":  "P1D",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Impact",
                                                             "DefenseEvasion"
                                                         ],
                                             "techniques":  [
                                                                "T1485",
                                                                "T1578"
                                                            ],
                                             "subTechniques":  [
                                                                   "T1578.003"
                                                               ],
                                             "alertRuleTemplateName":  "ed43bdb7-eaab-4ea4-be52-6951fcfa7e3b",
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {

                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "Caller"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddresses"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  "2.0.2"
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}