{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f48aeb03-b7a4-4d5c-9485-d174b2551d70')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f48aeb03-b7a4-4d5c-9485-d174b2551d70')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "MFA Fraud Alert generated by User - [WC-BASE]",
                                             "description":  "This rule detects when a user has reported MFA fraud (saying that they did not initiate this MFA prompt).\nIf this rule triggers, please make sure to escalate the alert to the customer.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let fraudAlertsFromAuditLogs = AuditLogs\r\n| where ActivityDisplayName contains  \"Fraud Reported\"\r\n| project TimeGenerated, UserPrincipalName = tostring(parse_json(InitiatedBy.user).userPrincipalName), AuthenticationMethod = tostring(parse_json(AdditionalDetails[0]).value),Activity = ActivityDisplayName;\r\nlet fraudAlertsFromSignInLogs = SigninLogs\r\n| where ResultType == 500121 and Status contains \"Fraud\"\r\n| project TimeGenerated, UserPrincipalName, IPAddress, Location, AppDisplayName, DeviceDetail, FraudStatus = Status;\r\nlet allFraudAlerts = union fraudAlertsFromAuditLogs, fraudAlertsFromSignInLogs;\r\nlet UserInfo = SigninLogs\r\n| project TimeGenerated, UserPrincipalName, IPAddress, Location, AppDisplayName, ClientAppUsed, DeviceDetail\r\n| summarize IPAddresses = make_set(IPAddress), AppsUsed = make_set(AppDisplayName), Locations = make_set(Location), Devices = make_set(DeviceDetail) by TimeGenerated, UserPrincipalName;\r\nallFraudAlerts\r\n| join kind=leftouter (UserInfo) on $left.UserPrincipalName == $right.UserPrincipalName\r\n| extend Time = format_datetime(TimeGenerated, 'yyyy-MM-dd HH')\r\n| summarize TimeGenerated = arg_max(TimeGenerated, *) , AuthenticationMethod = arg_max(AuthenticationMethod, *), IPAddresses = make_set(IPAddresses), AppsUsed = make_set(AppsUsed), Locations = make_set(Locations), Devices = make_set(Devices), AuditActivity = make_set(Activity), SigninActivity = make_set(FraudStatus) by UserPrincipalName, Time\r\n| project TimeGenerated,UserPrincipalName,AuditActivity,SigninActivity,AuthenticationMethod, IPAddresses, AppsUsed, Locations, Devices\r\n",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "InitialAccess",
                                                             "CredentialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1078",
                                                                "T1621"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT15M",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "Location":  "Locations"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "UserPrincipalName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddresses"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "Devices"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}