{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/11943536-f38e-48e2-b2cb-f99534e0a53f')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/11943536-f38e-48e2-b2cb-f99534e0a53f')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Multiple Password Reset by user - [WC-BASE-M]",
                                             "description":  "This query will determine multiple password resets by user across multiple data sources. \nAccount manipulation including password reset may aid adversaries in maintaining access to credentials.\nand certain permission levels within an environment.",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "let MultiplePasswordResetUsersAuditLogs = AuditLogs\n    | where TimeGenerated \u003e ago(1h)\n    | where ResultDescription contains \"User successfully reset password\"\n    | extend IPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) \n    | extend UserPrincipalName = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)\n    | summarize\n        StartTime = min(TimeGenerated),\n        EndTime = max(TimeGenerated),\n        IPAddresses = make_set(IPAddress),\n        TotalAttempts = count()\n        by UserPrincipalName,bin(TimeGenerated,15m)\n    | where TotalAttempts \u003e 2\n    | extend Case = \"Audit Logs\";\nlet MultiplePasswordResetUsersSecurityEvent = SecurityEvent\n    | where TimeGenerated \u003e ago(1h)\n    | where EventID in (\"4723\", \"4724\")\n    | summarize\n        StartTime = min(TimeGenerated),\n        EndTime = max(TimeGenerated),\n        TotalAttempts = count()\n        by Account,bin(TimeGenerated,15m)\n    | where TotalAttempts \u003e 50\n    | extend Case = \"Security Event\";\nMultiplePasswordResetUsersAuditLogs\n| union MultiplePasswordResetUsersSecurityEvent",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Persistence",
                                                             "InitialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1098",
                                                                "T1078"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  "0b9ae89d-8cad-461c-808f-0494f70ad5c4",
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT1H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  {
                                                                          "alertDynamicProperties":  [

                                                                                                     ]
                                                                      },
                                             "customDetails":  {
                                                                   "PasswordResetSource":  "Case"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "Account"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddresses"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "UserPrincipalName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  "2.1.1"
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}