{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/2edc19aa-812c-490d-b1eb-52c7571e3863\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/2edc19aa-812c-490d-b1eb-52c7571e3863\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Multi-Stage Network Activity and Suspicious File Access Detection - [WC-BASE]",
                                             "description":  "Detects multi-stage attack behavior by monitoring unusual network connections on non-standard ports, repeated connections, and access to potentially suspicious files, highlighting potential data exfiltration or command-and-control activities.",
                                             "severity":  "High",
                                             "enabled":  true,
                                             "query":  "let timeframe = 1h;\r\nlet connectionThreshold = 10;\r\nlet uncommonPorts = dynamic([21, 23, 8081, 8443, 9001, 1337, 6666]);\r\nlet uncommonPortConnections = \r\n    SecurityEvent\r\n    | where TimeGenerated \u003e= ago(timeframe)\r\n    | where EventID == 5156  \r\n    | where RemotePort in (uncommonPorts)\r\n    | project TimeGenerated, Computer, Account, IpAddress, RemotePort, ProcessName;\r\nlet repeatedConnections = \r\n    SecurityEvent\r\n    | where TimeGenerated \u003e= ago(timeframe)\r\n    | where EventID == 5156  \r\n    | summarize connectionCount = count() by Computer, IpAddress, bin(TimeGenerated, 1h)\r\n    | where connectionCount \u003e= connectionThreshold\r\n    | project TimeGenerated, Computer, IpAddress, connectionCount;\r\nlet suspiciousFileAccess = \r\n    SecurityEvent\r\n    | where TimeGenerated \u003e= ago(timeframe)\r\n    | where EventID == 4663  \r\n    | where FilePath has_any (\".zip\", \".rar\", \".exe\", \".iso\", \".dat\")  \r\n    | project TimeGenerated, Computer, Account, FilePath, IpAddress;\r\nsuspiciousFileAccess\r\n| join kind=inner repeatedConnections on Computer,IpAddress\r\n| join kind=inner uncommonPortConnections on Computer,IpAddress\r\n",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "CommandAndControl"
                                                         ],
                                             "techniques":  [
                                                                "T1104"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "Port":  "RemotePort"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "Computer"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "File",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "FilePath"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IpAddress1"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}