{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/eeeb1723-2a96-430e-849e-cfd3fea88278')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/eeeb1723-2a96-430e-849e-cfd3fea88278')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "New Device Added - [WC-BASE]",
                                             "description":  "A new device (excluding iOS devices) has been added into the Azure Active Directory environment and is required for confirmation as such devices may be considered rogue if not authorised for enrolment.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "AuditLogs\r\n| where OperationName contains \"Add device\"\r\n| extend DeviceID = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[6].newValue))[0])\r\n| extend DeviceName = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[10].newValue))[0])\r\n| extend DisplayName = tostring(TargetResources[0].displayName)\r\n| extend TimestampAddDevice = TimeGenerated\r\n// | project DeviceID, OperationVersion, DeviceName, DisplayName, TimestampAddDevice\r\n| join kind=inner\r\n    (\r\n    AuditLogs\r\n    | where OperationName contains \"Register device\"\r\n    | extend UPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)\r\n    | extend DeviceID = tostring(AdditionalDetails[4].value)\r\n    | extend TimestampRegisterDevice = TimeGenerated\r\n    | extend IPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)\r\n    | extend OS = tostring(AdditionalDetails[3].value)\r\n    | extend AdditionalInfo = tostring(AdditionalDetails[0].value)\r\n    // | project DeviceID, OperationVersion, UPN, TimestampRegisterDevice, IPAddress, OS, AdditionalInfo\r\n    ) on DeviceID\r\n// | project TimestampAddDevice, TimestampRegisterDevice, DeviceName, DeviceID, UPN, DisplayName, IPAddress, OS, AdditionalInfo\r\n| extend CustomEntity = strcat(\r\n    \"Device Added on: \", format_datetime(TimestampAddDevice, 'dd-MM-yyyy hh:mm:ss'),\r\n    \"\\n Device Addition Result: \", Result,\r\n    \"\\nDevice Registered on: \", format_datetime(TimestampRegisterDevice, 'dd-MM-yyyy hh:mm:ss'),\r\n    \"\\n Device Registration Result: \", Result1,\r\n    \"\\nDevice Name/User: \", DeviceName,\r\n    \"\\nDevice Display Name: \", DisplayName,\r\n    \"\\nDevice Operating System: \", OS,\r\n    \"\\nInitiated By: \", UPN\r\n    )",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Persistence",
                                                             "InitialAccess",
                                                             "ResourceDevelopment"
                                                         ],
                                             "techniques":  [
                                                                "T1136",
                                                                "T1078",
                                                                "T1585"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "CustomEntity":  "CustomEntity"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DisplayName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "UPN"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddress"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}