{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/34882714-dffa-4bcb-9864-5b78463969ed\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/34882714-dffa-4bcb-9864-5b78463969ed\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "O365 - Sign-in detected from suspicious country - [WC-BASE]",
                                             "description":  "This rule detects successful Office 365 sign-ins from countries that are considered high-risk or uncommon for the user. It correlates sign-in activity with known historical locations and excludes trusted/managed devices. A match may indicate potential account compromise or unauthorized access from a suspicious geographic location.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let UsersKnownLocations = SigninLogs\n| where TimeGenerated between (ago(14d) .. ago(1h))\n| where ResultType == 0\n| summarize UserKnownCountries = make_set(Location) by UserPrincipalName;\nlet ManagedAttempts = SigninLogs\n    | union AADNonInteractiveUserSignInLogs\n    | where TimeGenerated \u003e ago(14d)\n    | where (tostring(parse_json(DeviceDetail_dynamic).trustType) != \"\" or tostring(parse_json(DeviceDetail_string).trustType) != \"\") or (DeviceDetail_dynamic contains \"PII Removed\" or DeviceDetail_string contains \"PII Removed\")\n    | distinct IPAddress;\nSigninLogs\n| where TimeGenerated \u003e ago(1h)\n| where AppDisplayName contains \"Office 365 Exchange Online\" or AppDisplayName contains \"Office 365 SharePoint Online\" or AppDisplayName contains \"Office Home\" or AppDisplayName contains \"Outlook Mobile\"\n| where Location in (\"RU\",\"UA\",\"DZ\",\"AO\",\"BJ\",\"BW\",\"BF\",\"BI\",\"CM\",\"CV\",\"CF\",\"TD\",\"KM\",\"CG\",\"CD\",\"CI\",\"DJ\",\"EG\",\"GQ\",\"ER\",\"SZ\",\"ET\",\"GA\",\"GM\",\"GH\",\"GN\",\"GW\",\"KE\",\"LS\",\"LR\",\"LY\",\"MG\",\"MW\",\"ML\",\"MR\",\"MU\",\"MA\",\"MZ\",\"NA\",\"NE\",\"NG\",\"RW\",\"ST\",\"SN\",\"SC\",\"SL\",\"SO\",\"ZA\",\"SS\",\"SD\",\"TZ\",\"TG\",\"TN\",\"UG\",\"ZM\",\"ZW\")\n| where Location != \"\"\n| extend AccountCustomEntity = UserPrincipalName\n| extend IPCustomEntity = IPAddress\n| where ResultType == \"0\"\n| join kind=leftanti ManagedAttempts on IPAddress\n| join kind=leftouter UsersKnownLocations on UserPrincipalName\n| where not( UserKnownCountries has Location)",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "InitialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1078"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  true,
                                                                                                         "reopenClosedIncident":  true,
                                                                                                         "lookbackDuration":  "P1D",
                                                                                                         "matchingMethod":  "Selected",
                                                                                                         "groupByEntities":  [
                                                                                                                                 "Account"
                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "Location":  "Location"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "UserPrincipalName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddress"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}