{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/e9a6bbfa-afa8-4acb-b81c-7eca33ae0211\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/e9a6bbfa-afa8-4acb-b81c-7eca33ae0211\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Obfuscated Command with Potential C2 Channel - [WC-BASE]",
                                             "description":  "Detects potentially malicious PowerShell activity involving obfuscated commands (e.g., base64, fromCharCode, join, replace) correlated with suspicious outbound network connections to uncommon public ports. This pattern may indicate an active Command and Control (C2) channel using PowerShell as a communication or staging mechanism. The rule excludes known benign Defender ATP paths and limits scope to devices not yet onboarded into the security platform.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let OnboardedDevices =\r\nDeviceInfo\r\n| where TimeGenerated \u003e ago(14d)\r\n| where OnboardingStatus contains \"Onboarded\"\r\n| distinct DeviceName;\r\nlet ObfuscatedPowerShell = DeviceProcessEvents\r\n| where TimeGenerated \u003e ago(1h)\r\n| where FileName == \"powershell.exe\"\r\n| where ProcessCommandLine matches regex @\"(?i)(%{|\\Wjoin\\W|\\Wreplace\\W|\\Wfromcharcode\\W|base64)\"\r\n|where ProcessCommandLine !contains @\"C:\\ProgramData\\Microsoft\\Windows Defender Advanced Threat Protection\"\r\n| project PS_TimeGenerated = TimeGenerated, PS_DeviceName = DeviceName, PS_ProcessId = ProcessId, PS_CommandLine = ProcessCommandLine, PS_AccountName = AccountName;\r\nDeviceNetworkEvents\r\n| where TimeGenerated \u003e ago(1h)\r\n| where RemoteIPType == \"Public\"\r\n|where RemotePort !in (\"443\",\"80\") and RemotePort \u003c 1024\r\n| join kind=inner (\r\n    ObfuscatedPowerShell\r\n) on $left.DeviceName == $right.PS_DeviceName\r\n| where abs(datetime_diff(\u0027minute\u0027, TimeGenerated, PS_TimeGenerated)) \u003c= 5 \r\n| project TimeGenerated, DeviceName, ProcessCommandLine = PS_CommandLine, AccountName = PS_AccountName, RemoteIP, RemotePort, LocalIP, LocalPort, Protocol\r\n| order by TimeGenerated desc\r\n| extend DeviceName = tolower(DeviceName)\r\n| join kind=leftanti OnboardedDevices on DeviceName",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "CommandAndControl"
                                                         ],
                                             "techniques":  [
                                                                "T1001"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "RemoteIP"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "AccountName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}