{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/446af126-6917-4f5b-a9db-bc7494cc6357\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/446af126-6917-4f5b-a9db-bc7494cc6357\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Password Policy Discovery with Net.exe - [WC-BASE-W]",
                                             "description":  "\"This query identifies the use of net.exe or net1.exe commands to perform password policy discovery or manage accounts and groups on a system. It monitors specific actions such as querying account policies, enumerating users, or modifying local and domain groups. This activity could indicate reconnaissance or unauthorized account manipulation attempts, commonly associated with adversarial tactics during lateral movement or privilege escalation.",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "DeviceProcessEvents\r\n| where AccountSid != \"S-1-5-18\"\r\n| where InitiatingProcessCommandLine contains \"net\" and InitiatingProcessCommandLine contains \"accounts\"\r\n| where InitiatingProcessFileName contains \"net.exe\" or InitiatingProcessFileName contains \"net1.exe\"\r\n// WHITELIST START\r\n| extend RuleName = \u0027Password Policy Discovery with Net.exe\u0027\r\n| join kind=leftouter (_GetWatchlist(\u0027WizardCyberAnalyticalRulesTuning\u0027)\r\n) on RuleName\r\n| project-away RuleName,RuleName1\r\n| extend Tuning01 = todynamic(Tuning01)\r\n| extend Tuning02 = todynamic(Tuning02)\r\n| where not(  (TicketIDs contains \"3018010\" and isnotempty(Tuning01)) and (set_has_element( Tuning01,DeviceName)))\r\n| where not(  (TicketIDs contains \"3018010\" and isnotempty(Tuning02)) and MachineGroup == Tuning02.[0])\r\n| project-away Tuning*,TicketIDs\r\n// WHITELIST END\r\n",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Discovery"
                                                         ],
                                             "techniques":  [
                                                                "T1201",
                                                                "T1087",
                                                                "T1069"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {

                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "AccountName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}