{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/58f966aa-6dc9-4263-8831-dee434630575\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/58f966aa-6dc9-4263-8831-dee434630575\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Possible Phishing Email via SharePoint Link - [WC-BASE]",
                                             "description":  "This query detects potential phishing emails that contain SharePoint links and come from unusual or first-time external senders. It helps identify suspicious messages that may try to trick users into clicking malicious document links.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let TenantDomains = EmailEvents\r\n| where TimeGenerated \u003e ago(14d)\r\n| where EmailDirection contains \"Intra-org\"\r\n| distinct SenderFromDomain;\r\nEmailEvents\r\n| where TimeGenerated \u003e ago(1h)\r\n| where Subject contains \"shared\"\r\n| where Subject has_any (\"document\",\"documents\",\"share\",\"shared\")\r\n| where DeliveryAction contains \"Delivered\"\r\n| where EmailDirection contains \"Inbound\"\r\n| project-reorder TimeGenerated,Subject,SenderFromAddress,RecipientEmailAddress,DeliveryAction\r\n| join kind=inner (EmailUrlInfo | where TimeGenerated \u003e ago(1h)| project Url,NetworkMessageId,UrlDomain | where (UrlDomain endswith \"sharepointonline.com\" or UrlDomain endswith \"sharepoint.com\")) on NetworkMessageId\r\n| join kind=leftanti (EmailEvents\r\n| where TimeGenerated between (ago(14d) ..ago(1h) )\r\n| where DeliveryAction contains \"delivered\") on SenderFromAddress\r\n| where SenderFromDomain !in (TenantDomains)\r\n\r\n",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Reconnaissance",
                                                             "CredentialAccess"
                                                         ],
                                             "techniques":  [
                                                                "T1598",
                                                                "T1539",
                                                                "T1528"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "Subject":  "Subject"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "RecipientEmailAddress"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "MailMessage",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "NetworkMessageId",
                                                                                                  "columnName":  "NetworkMessageId"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "URL",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Url",
                                                                                                  "columnName":  "Url"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}