{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f63b5f3f-1edf-4bb2-a642-a8910c5d95fa')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f63b5f3f-1edf-4bb2-a642-a8910c5d95fa')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Potential Shadow Copy and Backup Tool Usage - [WC-BASE]",
                                             "description":  "• Monitor executed commands and arguments that could be taken to copy files from the logical drive and evade common file system protections. Since this technique may also be used through PowerShell, additional logging of PowerShell scripts is recommended.\n• Monitor for the creation of volume shadow copy and backup files, especially unexpected and irregular activity (relative to time, user, etc.).",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "DeviceFileEvents \r\n| where ActionType in (\"FileRead\", \"FileModified\", \"FileCreated\")\r\n| where FileName in~ (\"ntds.dit\", \"SYSTEM\", \"SAM\", \"*.vhd\", \"*.bak\") // Specific files of interest\r\n| where FolderPath startswith @\"C:\\Windows\\NTDS\\\" \r\n       or FolderPath contains @\"\\Device\\HarddiskVolumeShadowCopy\" // Access to shadow copies\r\n| where InitiatingProcessFileName in~ (\"esentutl.exe\", \"vssadmin.exe\", \"wbadmin.exe\", \"powershell.exe\") // Frequently used tools\r\n| where (\r\n    (InitiatingProcessFileName == \"powershell.exe\" and InitiatingProcessCommandLine has \"NinjaCopy\") // Specific tool usage\r\n    or (InitiatingProcessFileName == \"vssadmin.exe\" and InitiatingProcessCommandLine has_any (\"create\", \"delete\") and InitiatingProcessCommandLine has \"shadow\") // vssadmin shadow copy creation or deletion\r\n    or (InitiatingProcessFileName == \"wbadmin.exe\" and InitiatingProcessCommandLine has_any (\"backup\", \"delete\") and InitiatingProcessCommandLine has \"shadow\") // wbadmin backup or shadow copy operations\r\n    or (InitiatingProcessFileName == \"esentutl.exe\" and InitiatingProcessCommandLine has \"create\" and InitiatingProcessCommandLine has \"backup\") // esentutl backup operation\r\n) // Commands associated with shadow copy or backup operations\r\n| join kind=leftouter (\r\n    IdentityInfo\r\n    | project AccountObjectId, AccountUPN, AccountName, AccountDomain\r\n) on $left.InitiatingProcessAccountSid == $right.AccountObjectId\r\n| extend IsSuspicious = case(\r\n    RequestProtocol == \"Unknown\", true, // Potentially bypassed monitoring\r\n    FolderPath contains \"VolumeShadowCopy\", true, // Shadow copy access\r\n    false\r\n)\r\n| project\r\n    TimeGenerated,\r\n    DeviceName,\r\n    ActionType,\r\n    FileName,\r\n    FolderPath,\r\n    AccountUPN,\r\n    InitiatingProcessAccountName,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    RequestProtocol,\r\n    IsSuspicious\r\n| where IsSuspicious == true\r\n",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "DefenseEvasion"
                                                         ],
                                             "techniques":  [
                                                                "T1006"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "AzureResource",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "ResourceId",
                                                                                                  "columnName":  "InitiatingProcessAccountName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "AzureResource",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "ResourceId",
                                                                                                  "columnName":  "FolderPath"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "AzureResource",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "ResourceId",
                                                                                                  "columnName":  "FileName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}