{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/43f4b303-3c53-4f9e-bbb0-0bfb9bf4fc41\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/43f4b303-3c53-4f9e-bbb0-0bfb9bf4fc41\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Potentially Malicious Email Attachment Download - [WC-BASE]",
                                             "description":  "This rule detects potentially malicious attachment downloads by monitoring email activity. It triggers an alert when:\n\nAn attachment is downloaded from an email sent by a sender whose emails have been previously quarantined.\nAn attachment is downloaded from an email that has been classified as phishing by DFO.\nAn attachment is downloaded following a click on a URL within an email that has been identified as a phishing link.",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "let ZAPPEDEmail =\r\nEmailPostDeliveryEvents\r\n| where TimeGenerated \u003e ago(14d)\r\n| where ActionType in (\"Spam ZAP\",\"Phish ZAP\")\r\n| project NetworkMessageId,RecipientEmailAddress\r\n| join kind=inner (EmailAttachmentInfo\r\n| where TimeGenerated \u003e ago(14d)\r\n| project FileName,FileSize,NetworkMessageId) on NetworkMessageId\r\n| join kind=inner (DeviceFileEvents\r\n        | where TimeGenerated \u003e ago(1h))\r\n        on\r\n        FileName,\r\n        FileSize,\r\n        $left.RecipientEmailAddress == $right.InitiatingProcessAccountUpn\r\n    | where ActionType == \"FileCreated\"\r\n    | extend Case = \"Attachment Downloaded/Viewed before an email was ZAPPED\";\r\nlet BlockedEmails = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where DeliveryAction == \"Blocked\" and DeliveryLocation == \"Quarantine\"\r\n    | summarize\r\n        QuarantinedEmailsCount = dcount(NetworkMessageId),\r\n        BlockedRecipientsCount = dcount(RecipientEmailAddress)\r\n        by SenderFromAddress;\r\nlet PotentialPhishSender = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where EmailDirection == \"Inbound\"\r\n    | where DeliveryAction != \"Blocked\"\r\n    | summarize\r\n        EmailsCount = dcount(NetworkMessageId),\r\n        RecipientsCount = dcount(RecipientEmailAddress)\r\n        by SenderFromAddress\r\n    | join kind=inner BlockedEmails on SenderFromAddress\r\n    | where QuarantinedEmailsCount \u003e EmailsCount or BlockedRecipientsCount \u003e RecipientsCount;\r\nlet PotentialPhishing = \r\n    EmailEvents\r\n    | where TimeGenerated \u003e ago(14d) \r\n    | where EmailDirection == \"Inbound\"\r\n    | where DeliveryAction != \"Blocked\"\r\n    | where AttachmentCount != 0\r\n    | where OrgLevelAction != \"Allow\"\r\n    | where UserLevelAction != \"Allow\"\r\n    | join kind=inner PotentialPhishSender on SenderFromAddress\r\n    | join kind=inner EmailAttachmentInfo on NetworkMessageId, RecipientEmailAddress, SenderFromAddress\r\n    | join kind=inner (DeviceFileEvents\r\n        | where TimeGenerated \u003e ago(1h))\r\n        on\r\n        FileName,\r\n        FileSize,\r\n        $left.RecipientEmailAddress == $right.InitiatingProcessAccountUpn\r\n    | where ActionType == \"FileCreated\"\r\n    | extend Case = \"Suspicious Sender\";\r\nlet PhishEmail = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d) \r\n    | where ThreatTypes contains \"phish\"\r\n    | where EmailDirection == \"Inbound\"\r\n    | where DeliveryAction != \"Blocked\"\r\n    | where AttachmentCount != 0\r\n    | where OrgLevelAction != \"Allow\" \r\n    | where UserLevelAction != \"Allow\"\r\n    | join kind=inner EmailAttachmentInfo on NetworkMessageId, RecipientEmailAddress, SenderFromAddress\r\n    | join kind=inner (DeviceFileEvents\r\n        | where TimeGenerated \u003e ago(1h))\r\n        on\r\n        FileName,\r\n        FileSize,\r\n        $left.RecipientEmailAddress == $right.InitiatingProcessAccountUpn\r\n    | where ActionType == \"FileCreated\"\r\n    | extend Case = \"Phish email delivered\";\r\nlet PotentialPhishingCloudApps = \r\n    EmailEvents\r\n    | where TimeGenerated \u003e ago(14d) \r\n    | where EmailDirection == \"Inbound\"\r\n    | where DeliveryAction != \"Blocked\"\r\n    | where AttachmentCount != 0\r\n    | where OrgLevelAction != \"Allow\"\r\n    | where UserLevelAction != \"Allow\"\r\n    | join kind=inner PotentialPhishSender on SenderFromAddress\r\n    | join kind=inner EmailAttachmentInfo on NetworkMessageId, RecipientEmailAddress, SenderFromAddress\r\n    | join kind=inner (CloudAppEvents\r\n        | where TimeGenerated \u003e ago(1h)\r\n        | where ActionType in (\"FileDownloadedFromBrowser\")\r\n        | extend FilePath = tostring(parse_json(RawEventData).ObjectId)\r\n        | project\r\n            UserId = tostring(parse_json(RawEventData).UserId),\r\n            FilePath,\r\n            FileName = tostring(split(FilePath, \"\\\\\").[-1]),\r\n            FileSize = tolong(parse_json(RawEventData).FileSize))\r\n        on FileName, FileSize, $left.RecipientEmailAddress == $right.UserId\r\n    | extend Case = \"Suspicious Sender\";\r\nlet PhishEmailCloudApps = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d) \r\n    | where ThreatTypes contains \"phish\"\r\n    | where EmailDirection == \"Inbound\"\r\n    | where DeliveryAction != \"Blocked\"\r\n    | where AttachmentCount != 0\r\n    | where OrgLevelAction != \"Allow\" \r\n    | where UserLevelAction != \"Allow\"\r\n    | join kind=inner EmailAttachmentInfo on NetworkMessageId, RecipientEmailAddress, SenderFromAddress\r\n    | join kind=inner (CloudAppEvents\r\n        | where TimeGenerated \u003e ago(1h)\r\n        | where ActionType in (\"FileDownloadedFromBrowser\")\r\n        | extend FilePath = tostring(parse_json(RawEventData).ObjectId)\r\n        | project\r\n            UserId = tostring(parse_json(RawEventData).UserId),\r\n            FilePath,\r\n            FileName = tostring(split(FilePath, \"\\\\\").[-1]),\r\n            FileSize = tolong(parse_json(RawEventData).FileSize))\r\n        on FileName, FileSize, $left.RecipientEmailAddress == $right.UserId\r\n    | extend Case = \"Phish email delivered\";\r\nPotentialPhishing\r\n| union PhishEmail\r\n| union PotentialPhishingCloudApps\r\n| union PhishEmailCloudApps\r\n| union ZAPPEDEmail\r\n| where isnotempty(SenderFromAddress)\r\n| where not (FileName matches regex @\"^image\\d{3}\\.(png|jpg)$\")",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Reconnaissance"
                                                         ],
                                             "techniques":  [
                                                                "T1598"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  {
                                                                          "alertDynamicProperties":  [

                                                                                                     ]
                                                                      },
                                             "customDetails":  {
                                                                   "SenderAddress":  "SenderFromAddress"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "RecipientEmailAddress"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "File",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "FileName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "MailMessage",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "NetworkMessageId",
                                                                                                  "columnName":  "NetworkMessageId"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}