{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6a33bc2b-df0c-41d3-94ff-0d1ff4e2af44')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6a33bc2b-df0c-41d3-94ff-0d1ff4e2af44')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Remote Windows Indirect Command Execution via pcalua.exe - [WC-BASE]",
                                             "description":  "This query detects suspicious activity involving pcalua.exe, the Windows Program Compatibility Assistant, used to execute commands indirectly. The query identifies instances where pcalua.exe is executed with the -a argument, which specifies an application to run. While pcalua.exe can legitimately launch programs, attackers may abuse it to bypass command-line execution restrictions or evade detection.",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "DeviceProcessEvents\r\n| where InitiatingProcessCommandLine contains \"pcalua.exe\" and InitiatingProcessCommandLine contains \"-a\"\r\n| summarize \r\n    EventCount = count(), \r\n    FirstSeen = min(TimeGenerated), \r\n    LastSeen = max(TimeGenerated) \r\n  by \r\n    DeviceName, \r\n    AccountName, \r\n    InitiatingProcessCommandLine, \r\n    InitiatingProcessFileName, \r\n    FileName,\r\n    FolderPath,\r\n    ProcessCommandLine, \r\n    ProcessId, \r\n    InitiatingProcessId\r\n| extend \r\n    FirstSeen = format_datetime(FirstSeen, 'yyyy-MM-dd HH:mm:ss'),\r\n    LastSeen = format_datetime(LastSeen, 'yyyy-MM-dd HH:mm:ss')\r\n| project-reorder FirstSeen, LastSeen",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "DefenseEvasion"
                                                         ],
                                             "techniques":  [
                                                                "T1202"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "AccountName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "File",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "InitiatingProcessFileName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}