{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ee6da34f-985c-44cb-a404-06f284a8f293')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ee6da34f-985c-44cb-a404-06f284a8f293')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Security Group cloning using power shell - [WC-BASE-W]",
                                             "description":  "",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "MicrosoftGraphActivityLogs\r\n| where UserAgent contains \"PowerShell\"\r\n| where RequestUri has_all(\"https://graph.microsoft.com/v1.0/groups/\", \"/members/$ref\")\r\n    or RequestUri has_all(\"https://graph.microsoft.com/v1.0/groups\", \"/members\")\r\n    or RequestUri == \"https://graph.microsoft.com/v1.0/groups?=securityEnabled%20eq%20true\"\r\n    or RequestUri == \"https://graph.microsoft.com/v1.0/me\"\r\n| extend GroupObjectId = tostring(extract(@\"groups/(.*?)/members\", 1, RequestUri))\r\n// WHITELIST START\r\n| extend RuleName = 'Security Group cloning using power shell'\r\n| join kind=leftouter (_GetWatchlist('WizardCyberAnalyticalRulesTuning')\r\n) on RuleName\r\n| project-away RuleName,RuleName1\r\n| extend Tuning01 = todynamic(Tuning01)\r\n| where not(  (TicketIDs contains \"3017892\" and isnotempty(Tuning01)) and ServicePrincipalId == Tuning01.[0]  )\r\n| project-away Tuning*,TicketIDs\r\n// WHITELIST END\r\n",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Persistence"
                                                         ],
                                             "techniques":  [
                                                                "T1078"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  null,
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}