{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c2b6b916-ffb1-4e65-ad59-a0f73185ae28')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c2b6b916-ffb1-4e65-ad59-a0f73185ae28')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "NRT",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "SOC Email Quarantine Detection - [WC-BASE]",
                                             "description":  "This rule detects instances when emails either sent to or received from the SOC are quarantined. In the event of detection, immediate actions are recommended, including releasing the email from quarantine or initiating a resend process.",
                                             "severity":  "High",
                                             "enabled":  true,
                                             "query":  "EmailEvents\r\n| where DeliveryLocation contains \"Quarantine\" or EmailAction contains \"Send to quarantine\"\r\n| where SenderFromAddress contains \"soc@wizardcyber.com\" or RecipientEmailAddress contains \"soc@wizardcyber.com\"\r\n| project TimeGenerated, DeliveryLocation, EmailAction, Subject, NetworkMessageId,SenderDisplayName, SenderFromAddress, RecipientEmailAddress, InternetMessageId",
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "tactics":  [
                                                             "Impact"
                                                         ],
                                             "techniques":  [
                                                                "T1489"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "MailMessage",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Recipient",
                                                                                                  "columnName":  "RecipientEmailAddress"
                                                                                              },
                                                                                              {
                                                                                                  "identifier":  "NetworkMessageId",
                                                                                                  "columnName":  "NetworkMessageId"
                                                                                              },
                                                                                              {
                                                                                                  "identifier":  "Subject",
                                                                                                  "columnName":  "Subject"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}