{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8a57150f-8f98-4b25-bd8c-fcdf93c3171b')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8a57150f-8f98-4b25-bd8c-fcdf93c3171b')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Suspicious Mailbox Right Delegation - [WC-BASE]",
                                             "description":  "This rule will identify the assignment of rights to accesss content from another mailbox. This is usually only assigned to a service account.",
                                             "severity":  "High",
                                             "enabled":  true,
                                             "query":  "let ManagedAttempts = SigninLogs\n    | union AADNonInteractiveUserSignInLogs\n    | where TimeGenerated \u003e ago(14d)\n    | where tostring(parse_json(DeviceDetail_dynamic).trustType) != \"\"\n        or tostring(parse_json(DeviceDetail_string).trustType) != \"\"\n        or DeviceDetail_dynamic contains \"PII Removed\"\n        or DeviceDetail_string contains \"PII Removed\"\n    | distinct IPAddress;\nlet NonManagedUsers = SigninLogs\n| where TimeGenerated \u003e ago(7d)\n| join kind=leftanti ManagedAttempts on IPAddress\n| where ResultType !in (\"50126\",\"50053\")\n| distinct UserPrincipalName = tolower(UserPrincipalName);\nOfficeActivity\n| where TimeGenerated \u003e ago(1h)\n| where ((Operation =~ 'Add-MailboxPermission') and (* contains 'FullAccess' or * contains 'SendAs' or * contains 'SendOnBehalf'))\n| where parse_json(Parameters)[1] !contains \"DiscoverySearchMailbox\"\n| extend IPAddress = iff(\n                         ClientIP matches regex @'^\\[[0-9a-fA-F:]+\\]:\\d+$', // Matches IPv6 with port\n                         replace(@'^\\[([0-9a-fA-F:]+)\\]:\\d+$', @'\\1', tostring(ClientIP)),\n                         iff(\n    ClientIP matches regex @'^\\d{1,3}(\\.\\d{1,3}){3}:\\d+$', // Matches IPv4 with port\n    replace(@'^(\\d{1,3}(\\.\\d{1,3}){3}):\\d+$', @'\\1', ClientIP),\n    'Invalid IP' // Handle case if it doesn't match either pattern\n)\n                     )\n| join kind=leftanti ManagedAttempts on $left.IPAddress == $right.IPAddress\n| extend UserId = tolower(UserId)\n| join kind=inner  NonManagedUsers on $left.UserId == $right.UserPrincipalName",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P14D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Persistence"
                                                         ],
                                             "techniques":  [
                                                                "T1098"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "TargetUserId"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "HostName",
                                                                                                  "columnName":  "LogonUserDisplayName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "IP",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Address",
                                                                                                  "columnName":  "IPAddress"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}