{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/32a82c63-d2b6-44a8-bb5b-919858cae079')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/32a82c63-d2b6-44a8-bb5b-919858cae079')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Suspicious network connection from MSBuild - [WC-BASE]",
                                             "description":  "This detection identifies instances where msbuild.exe executes without any accompanying command-line arguments. Such behavior is uncommon and may indicate malicious use of MSBuild for proxy execution or command-and-control (C2) activity.\nAdversaries leveraging the ArechClient2 remote access tool and similar malware have been observed using msbuild.exe in this manner to establish outbound network connections without typical build commands. Monitoring for msbuild.exe invocations lacking command-line arguments can help detect potential misuse of this trusted developer utility.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "DeviceNetworkEvents\r\n| where InitiatingProcessFileName =~ \"msbuild.exe\" and (isempty(InitiatingProcessCommandLine) or InitiatingProcessCommandLine =~ \"msbuild.exe\")\r\n",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "DefenseEvasion"
                                                         ],
                                             "techniques":  [
                                                                "T1127"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "AzureResource",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "ResourceId",
                                                                                                  "columnName":  "InitiatingProcessAccountDomain"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "AzureResource",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "ResourceId",
                                                                                                  "columnName":  "InitiatingProcessCommandLine"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "AzureResource",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "ResourceId",
                                                                                                  "columnName":  "RemoteIP"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}