{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/99f0670e-bfcc-4aa2-a725-37be030c6815')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/99f0670e-bfcc-4aa2-a725-37be030c6815')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Suspicious Non-Application Protocol Traffic Detection - [WC-BASE]",
                                             "description":  "This rule Monitors network traffic using non-application layer protocols and unusual ports, highlighting potential covert communication or data exfiltration attempts. Detects repeated connections using ICMP, TCP, or UDP outside typical application-layer traffic",
                                             "severity":  "Low",
                                             "enabled":  true,
                                             "query":  "let timeframe = 15m;  \r\nlet commonApplicationPorts = dynamic([80, 443, 53, 8080]);  \r\nlet connectionThreshold = 10;  \r\nlet nonAppLayerTraffic = \r\n    SecurityEvent\r\n    | where TimeGenerated \u003e= ago(timeframe)\r\n    | where EventID == 3  \r\n    | where RemotePort !in (commonApplicationPorts)\r\n    | where isnotempty( RemotePort)  \r\n    | project TimeGenerated, Computer, Account, IpAddress, RemotePort, ProcessName;\r\nlet repeatedNonAppConnections = \r\n    SecurityEvent\r\n    | where TimeGenerated \u003e= ago(timeframe)\r\n    | where EventID == 3  \r\n    | where RemotePort !in (commonApplicationPorts)\r\n    | where isnotempty( RemotePort)    \r\n    | summarize connectionCount = count() by Computer, IpAddress, RemotePort, bin(TimeGenerated, 1h)\r\n    | where connectionCount \u003e= connectionThreshold\r\n    | project TimeGenerated, Computer, IpAddress, RemotePort, connectionCount;\r\nnonAppLayerTraffic\r\n| union repeatedNonAppConnections\r\n| order by TimeGenerated desc\r\n",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "CommandAndControl"
                                                         ],
                                             "techniques":  [
                                                                "T1095"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "Computer"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}