{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e7e24eef-30b4-434f-b980-1a0a606bc0d2')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e7e24eef-30b4-434f-b980-1a0a606bc0d2')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "USB Data Exfiltration Detected - [WC-BASE]",
                                             "description":  "This rule detects if a user exfiltrates any data from their device onto USB removable storage media",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let DeviceNameToSearch = ''; // DeviceName to search for. Leave blank to search all devices.\r\nlet TimespanInSeconds = 3600; // Period of time between device insertion and file copy\r\nlet FileExtension = dynamic([\"pptx\",\"xlsx\",\"docx\",\"exe\",\"csv\",\"png\",\"jpg\"]);\r\nlet DriveLetter = DeviceEvents\r\n    | where ActionType has \"UsbDriveMounted\"\r\n    | extend USBDriveLetter = tostring(AdditionalFields.DriveLetter)\r\n    | project DeviceId, DeviceName, USBDriveLetter\r\n    | where isnotempty(USBDriveLetter);\r\nlet Connections =\r\n    DeviceEvents\r\n    | where (isempty(DeviceNameToSearch) or DeviceName =~ DeviceNameToSearch) and ActionType == \"PnpDeviceConnected\"\r\n    | extend parsed = parse_json(AdditionalFields)\r\n    | project\r\n        DeviceId,\r\n        DeviceName,\r\n        ConnectionTime = Timestamp,\r\n        DriveClass = tostring(parsed.ClassName),\r\n        UsbDeviceId = tostring(parsed.DeviceId),\r\n        ClassId = tostring(parsed.DeviceId),\r\n        DeviceDescription = tostring(parsed.DeviceDescription),\r\n        VendorIds = tostring(parsed.VendorIds)\r\n    | where DriveClass == 'USB' and DeviceDescription == 'USB Mass Storage Device'\r\n    | join kind=inner DriveLetter on DeviceId, DeviceName\r\n    | project-away DeviceId1, DeviceName1;\r\nDeviceFileEvents\r\n| where ActionType in (\"FileRenamed\", \"FileModified\", \"FileCreated\")\r\n| where (isempty(DeviceNameToSearch) or DeviceName =~ DeviceNameToSearch)\r\n| join kind=inner Connections on DeviceId, DeviceName\r\n| project-away DeviceId1, DeviceName1\r\n| where FolderPath startswith USBDriveLetter\r\n| where FolderPath has_any (FileExtension)\r\n| summarize\r\n    Files = make_set(FolderPath),\r\n    FilesCount = dcount(FolderPath),\r\n    Starttime = min(TimeGenerated),\r\n    EndTime = max(TimeGenerated),\r\n    Actions = make_set(ActionType),\r\n    USBIDs = make_set(UsbDeviceId)\r\n    by\r\n    InitiatingProcessAccountName,\r\n    USBDriveLetter,\r\n    DriveClass,\r\n    DeviceName,\r\n    DeviceId,\r\n    InitiatingProcessAccountUpn\r\n| mv-expand Files\r\n| where FilesCount \u003e 150",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "Exfiltration",
                                                             "Collection"
                                                         ],
                                             "techniques":  [
                                                                "T1052",
                                                                "T1025"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  {
                                                                   "FilesCount":  "FilesCount"
                                                               },
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "InitiatingProcessAccountUpn"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "HostName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}