{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId(\u0027Microsoft.OperationalInsights/workspaces/providers\u0027, parameters(\u0027workspace\u0027), \u0027Microsoft.SecurityInsights\u0027),\u0027/alertRules/e6f4c055-3319-4755-8b3d-e5f6fc955fa8\u0027)]",
                          "name":  "[concat(parameters(\u0027workspace\u0027),\u0027/Microsoft.SecurityInsights/e6f4c055-3319-4755-8b3d-e5f6fc955fa8\u0027)]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "User Involved in multiple Security Alerts - [WC-BASE]",
                                             "description":  "This rule detects when a user has triggered multiple security alerts involving credential and initial access.",
                                             "severity":  "Informational",
                                             "enabled":  true,
                                             "query":  "SecurityAlert\r\n| where isnotempty(Entities)\r\n| extend Entities = todynamic(Entities)\r\n| mv-expand Entities\r\n| project DisplayName, Entities\r\n| where DisplayName !contains \"DLP\"\r\n| where DisplayName !contains \"quarantined\" and DisplayName !contains \"quarantine\"\r\n| where DisplayName !contains \"after delivery\"\r\n| where Entities contains \"@\"\r\n| extend UPN = case(\r\n                   isnotempty(Entities.UserPrincipalName),\r\n                   Entities.UserPrincipalName,\r\n                   isnotempty(Entities.Name),\r\n                   Entities.Name,\r\n                   isnotempty(Entities.P1Sender),\r\n                   Entities.P1Sender,\r\n                   isnotempty(Entities.Recipient),\r\n                   Entities.Recipient,\r\n                   isnotempty(Entities.Upn),\r\n                   Entities.Upn,\r\n                   \"Null\"\r\n               )\r\n| where UPN != \"Null\"\r\n| distinct DisplayName, UPN\r\n| summarize Alerts = make_set(DisplayName), AlertsCount = count() by UPN\r\n| where AlertsCount \u003e 4",
                                             "queryFrequency":  "PT4H",
                                             "queryPeriod":  "PT4H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [

                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "UPN"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}