{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2066f90b-e9f5-42dc-9c8f-199efd92b79a')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2066f90b-e9f5-42dc-9c8f-199efd92b79a')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Web Request by File Execution - [WC-BASE]",
                                             "description":  "Detects when a file executes a web request (Invoke-WebRequest) and successfully connects to a public IP address.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "DeviceProcessEvents\r\n| where TimeGenerated \u003e ago(1h)\r\n| where FileName == \"powershell.exe\" or FileName == \"cmd.exe\"\r\n| where ProcessCommandLine contains \"Invoke-WebRequest\" or InitiatingProcessCommandLine contains \"Invoke-WebRequest\"\r\n| extend ProcessInitiatingProcessFileName = InitiatingProcessFileName\r\n| join kind=inner (DeviceNetworkEvents\r\n    | where TimeGenerated \u003e ago(1h) \r\n    | where InitiatingProcessCommandLine has \"Invoke-Webrequest\"\r\n    | where ActionType == \"ConnectionSuccess\"\r\n    | where RemoteIPType == \"Public\")\r\n    on DeviceName\r\n| join kind=inner (DeviceFileEvents\r\n    | where TimeGenerated \u003e ago(24h)\r\n    | where ActionType == \"FileCreated\")\r\n    on $left.ProcessInitiatingProcessFileName == $right.FileName\r\n| where InitiatingProcessFolderPath !contains \"cybercns\"",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "P1D",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "CommandAndControl",
                                                             "Execution"
                                                         ],
                                             "techniques":  [
                                                                "T1105",
                                                                "T1059",
                                                                "T1204"
                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "InitiatingProcessAccountUpn"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "DeviceName1"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "URL",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Url",
                                                                                                  "columnName":  "RemoteUrl"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "File",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "FileName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}