{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1f40bc84-02f7-47e4-9eed-99614e994be3')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1f40bc84-02f7-47e4-9eed-99614e994be3')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Vectra - Alert Detected Category: Lateral Movement - [WC-BASE]",
                                             "description":  "An alert has been generated in Vectra.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "let WizardUsers = _GetWatchlist(\"WizardUsers\")\r\n    | project UPN = SearchKey;\r\nlet NoneBlockedEmails = EmailEvents\r\n    | where TimeGenerated \u003e ago(14d)\r\n    | where DeliveryAction != \"Blocked\" and DeliveryLocation != \"Quarantine\"\r\n    | summarize Subjects = make_set(Subject) by SenderFromAddress;\r\nVectraDetections\r\n| where TimeGenerated \u003e ago(1h)\r\n| where ['Detection Category'] == \"lateral_movement\"\r\n| extend\r\n    DataColumnSize = strlen(Details),\r\n    DetectionDetailsColumnSize = strlen(['Detection Details'])\r\n| extend Details = iff(DataColumnSize \u003e 10000, \"Log size too large, please run the query \\\"VectraDetections\\\" manually to get the logs\", Details)\r\n| extend ['Detection Details'] = iff(DetectionDetailsColumnSize \u003e 10000, \"Log size too large, please run the query \\\"VectraDetections\\\" manually to get the logs\", ['Detection Details'])\r\n| project-away DataColumnSize, DetectionDetailsColumnSize\r\n| extend SenderFromAddress = replace(@\"^O365:\", \"\", ['Entity UID'])\r\n| extend EmailSubject = tostring(parse_json(Details)[0].subject)\r\n| join kind=leftouter NoneBlockedEmails on SenderFromAddress\r\n| where not((['Detection Name'] == \"M365 Internal Spearphishing\") and ((Subjects !has EmailSubject) or isempty(Subjects)))\r\n| where not((['Detection Name'] == \"M365 Risky Exchange Operation\") and (['Entity UID'] has_any (WizardUsers)))\r\n| where not((['Detection Name'] == \"Azure AD Privilege Operation Anomaly\") and (['Entity UID'] has_any (WizardUsers)))\r\n| where not((['Detection Name'] == \"Azure AD Unusual Scripting Engine Usage\") and (['Entity UID'] has_any (WizardUsers)))",
                                             "queryFrequency":  "PT1H",
                                             "queryPeriod":  "PT1H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [
                                                             "LateralMovement"
                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  null,
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}