{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/af3f1722-1c72-49bd-85bc-9e7206903279')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/af3f1722-1c72-49bd-85bc-9e7206903279')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Powershell Execute COM Object",
                                             "description":  "This detection identifies PowerShell scripts leveraging the MsXml COM object (MsXml2.XMLHTTP) with interactive prompts. Attackers use this technique for:\nFileless execution of malicious scripts.\nDownloading and executing remote payloads without writing to disk.\nUser deception via prompts to gain credentials or execute commands.",
                                             "severity":  "Medium",
                                             "enabled":  true,
                                             "query":  "DeviceProcessEvents\r\n| where InitiatingProcessFileName == \"powershell.exe\"\r\n| where ProcessCommandLine has_any (\"MsXml2.XMLHTTP\", \"MsXml2.ServerXMLHTTP\") or  ProcessCommandLine has_any (\"Read-Host\", \"Prompt\", \"ShowMessage\", \"InputBox\")\r\n| project\r\n    TimeGenerated,\r\n    DeviceName,\r\n    AccountUpn,\r\n    ProcessCommandLine,\r\n    InitiatingProcessFileName,\r\n    InitiatingProcessCommandLine,\r\n    InitiatingProcessParentFileName,\r\n    AccountDomain,\r\n    ProcessId,\r\n    FolderPath,\r\n    SHA256,\r\n    MD5\r\n| order by TimeGenerated desc\r\n| project-reorder TimeGenerated, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessParentFileName, ProcessId, DeviceName",
                                             "queryFrequency":  "PT5M",
                                             "queryPeriod":  "PT5M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  "2025-03-02T02:00:00.000Z",
                                             "tactics":  [
                                                             "Execution"
                                                         ],
                                             "techniques":  [
                                                                "T1059"
                                                            ],
                                             "subTechniques":  [
                                                                   "T1059.001"
                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Host",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "HostName",
                                                                                                  "columnName":  "DeviceName"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "Process",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "CommandLine",
                                                                                                  "columnName":  "ProcessCommandLine"
                                                                                              }
                                                                                          ]
                                                                    },
                                                                    {
                                                                        "entityType":  "File",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "Name",
                                                                                                  "columnName":  "InitiatingProcessFileName"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}