{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a36a478b-3ad3-4e46-b435-35f2c5974f03')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a36a478b-3ad3-4e46-b435-35f2c5974f03')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "Tenant Allow/Block List entry is about to expire",
                                             "description":  "A Tenant Allow/Block List entry will be removed due to expiration.",
                                             "severity":  "Informational",
                                             "enabled":  true,
                                             "query":  "CloudAppEvents\r\n| where ActionType == \"TenantAllowBlockListItemExpiry\"\r\n| extend UpdatedColumn = replace_string(tostring(RawEventData.Reason), \"ListType=\", \"EntityType=\")\r\n| extend DataArray = split(UpdatedColumn,\";\")\r\n| extend Action = DataArray[1]\r\n| extend EntryType = DataArray[2]\r\n| extend name = DataArray[4]\r\n| extend Entity = strcat(\"$@$ • \",Action,\", \",EntryType,\", \",name)\r\n|summarize FullEntities = make_set(Entity) by bin(TimeGenerated,15m)\r\n| extend FormattedEntities =strcat_array(FullEntities,\"\")\r\n| distinct FormattedEntities",
                                             "queryFrequency":  "PT15M",
                                             "queryPeriod":  "PT15M",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  null,
                                             "tactics":  [

                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  false,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "AlertPerResult"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  [
                                                                    {
                                                                        "entityType":  "Account",
                                                                        "fieldMappings":  [
                                                                                              {
                                                                                                  "identifier":  "FullName",
                                                                                                  "columnName":  "FormattedEntities"
                                                                                              }
                                                                                          ]
                                                                    }
                                                                ],
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}