{
    "contentVersion":  "1.0.0.0",
    "$schema":  "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "resources":  [
                      {
                          "id":  "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/99e177da-3e77-4aac-8034-3653352d44d5')]",
                          "name":  "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/99e177da-3e77-4aac-8034-3653352d44d5')]",
                          "type":  "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                          "kind":  "Scheduled",
                          "apiVersion":  "2023-12-01-preview",
                          "properties":  {
                                             "displayName":  "User Monitoring Summary  - [WC-CR]",
                                             "description":  "This query monitors the insider risk activities done by user Shervin Zangeneh from Dermalogica.",
                                             "severity":  "Informational",
                                             "enabled":  false,
                                             "query":  "let UserUPN = dynamic([\"adm-shervin@dermalogica.com\", \"shervin.zangeneh@dermalogica.com\"]);\r\nlet AlertOfficeOperations = \r\n    workspace(\"Deramalogic-Sentinel\").OfficeActivity\r\n    | where UserId has_any (UserUPN)\r\n    | where Operation in~ (\"Add-MailboxFolderPermission\", \"Set-Mailbox\", \"New-ManagementRoleAssignment\", \"New-InboxRule\", \"Set-InboxRule\", \"Set-TransportRule\")\r\n        and not(UserId has_any ('NT AUTHORITY\\\\SYSTEM (Microsoft.Exchange.ServiceHost)', 'NT AUTHORITY\\\\SYSTEM (w3wp)', 'devilfish-applicationaccount', 'NT AUTHORITY\\\\SYSTEM (Microsoft.Exchange.AdminApi.NetCore)') and Operation in~ (\"Add-MailboxPermission\", \"Set-Mailbox\"))\r\n    | extend IPAddress = ClientIP\r\n    | project TimeGenerated, Operation, UserId, IPAddress, OfficeObjectId, ResultStatus, Parameters\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserId,\r\n                           \"\\nOperation: \",\r\n                           Operation,\r\n                           \"\\nOfficeObjectId: \",\r\n                           OfficeObjectId,\r\n                           \"\\nResultStatus: \",\r\n                           ResultStatus,\r\n                           \"\\nParameters: \",\r\n                           tostring(Parameters),\r\n                           \"\\nIPAddress: \",\r\n                           IPAddress\r\n                       )\r\n    | project TimeGenerated, Case = \"Exchange Office Operation\", Details;\r\nlet AlertSigninlogs = \r\n    workspace(\"Deramalogic-Sentinel\").SigninLogs\r\n    | where UserPrincipalName has_any (UserUPN)\r\n    | where ResultType == 0\r\n    | where isnotempty(Location)\r\n    | where isnotempty(LocationDetails.state)\r\n    | extend State = tostring(parse_json(LocationDetails).state)\r\n    | extend LocationDetail = strcat(Location, \"-\", State)\r\n    | extend\r\n        DeviceName = DeviceDetail.deviceName,\r\n        DeviceOS = tostring(parse_json(DeviceDetail.operatingSystem)) \r\n    | extend DeviceName = iff(isempty(DeviceName), \"N/A\", DeviceName)\r\n    | extend DeviceOS= iff(isempty(DeviceOS), \"N/A\", DeviceOS)\r\n    | summarize \r\n        TimeGenerated = min(TimeGenerated),\r\n        LocationDetail = make_set(LocationDetail),\r\n        AppDisplayName = make_set(AppDisplayName),\r\n        DeviceName = make_set(DeviceName),\r\n        DeviceOS = make_set(DeviceOS),\r\n        IPAddress = make_set(IPAddress)\r\n        by UserPrincipalName\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserPrincipalName,\r\n                           \"\\nLocation: \",\r\n                           tostring(LocationDetail),\r\n                           \"\\nAppDisplayName: \",\r\n                           tostring(AppDisplayName),\r\n                           \"\\nDeviceName: \",\r\n                           tostring(DeviceName),\r\n                           \"\\nDeviceOS: \",\r\n                           tostring(DeviceOS),\r\n                           \"\\nIPAddress: \",\r\n                           tostring(IPAddress)\r\n                       )\r\n    | project TimeGenerated, Case = \"Sign-in Activity\", Details;\r\nlet AlertMassDeletion =\r\n    workspace(\"Deramalogic-Sentinel\").OfficeActivity\r\n    | where UserId has_any (UserUPN)\r\n    | where Operation contains \"Delete\"\r\n    | extend IPAddress = iff(isempty(ClientIP), ClientIP_, ClientIP)\r\n    | summarize\r\n        StartTime = min(TimeGenerated),\r\n        EndTime = max(TimeGenerated),\r\n        FilesCount = dcount(SourceFileName),\r\n        Files = make_set(OfficeObjectId)\r\n        by UserId, IPAddress\r\n    | where FilesCount \u003e 20\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserId,\r\n                           \"\\nIPAddress: \",\r\n                           IPAddress,\r\n                           \"\\nFilesCount: \",\r\n                           tostring(FilesCount),\r\n                           \"\\nFiles: \",\r\n                           tostring(Files),\r\n                           \"\\nStartTime: \",\r\n                           tostring(StartTime),\r\n                           \"\\nEndTime: \",\r\n                           tostring(EndTime)\r\n                       )\r\n    | project TimeGenerated = StartTime, Case = \"Mass File Deletion\", Details;\r\nlet AlertFileDownload = workspace(\"Deramalogic-Sentinel\").OfficeActivity \r\n    | where (RecordType == \"SharePointFileOperation\" or RecordType == \"OneDriveFileOperation\") \r\n    | extend IPAddress = iff(isempty(ClientIP), ClientIP_, ClientIP)\r\n    | where Operation == \"FileDownloaded\" \r\n    | where UserId has_any (UserUPN)\r\n    | summarize\r\n        StartTime = min(TimeGenerated),\r\n        EndTime = max(TimeGenerated),\r\n        DownloadedFiles = make_set(OfficeObjectId)\r\n        by UserId, IPAddress\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserId,\r\n                           \"\\nIPAddress: \",\r\n                           IPAddress,\r\n                           \"\\nDownloadedFiles: \",\r\n                           tostring(DownloadedFiles),\r\n                           \"\\nStartTime: \",\r\n                           tostring(StartTime),\r\n                           \"\\nEndTime: \",\r\n                           tostring(EndTime)\r\n                       )\r\n    | project\r\n        TimeGenerated = StartTime,\r\n        Case = \"Downloaded files from SharePoint/OneDrive\",\r\n        Details;\r\nlet Alertsecure_link_creation = workspace(\"Deramalogic-Sentinel\").OfficeActivity \r\n    | where UserId has_any (UserUPN)\r\n    | where Operation == \"SecureLinkCreated\" \r\n    | summarize LinksCreated = make_set(SourceFileName) by UserId \r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserId,\r\n                           \"\\nLinksCreated: \",\r\n                           tostring(LinksCreated)\r\n                       )\r\n    | extend Case = \"Created secure links\"\r\n    | project TimeGenerated = now(), Case, Details;\r\nlet Alertadded_users_to_links = workspace(\"Deramalogic-Sentinel\").OfficeActivity \r\n    | where UserId has_any (UserUPN)\r\n    | where Operation == \"AddedToSecureLink\" \r\n    | summarize TargetUsers = make_set(TargetUserOrGroupName) by UserId \r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserId,\r\n                           \"\\nTargetUsers: \",\r\n                           tostring(TargetUsers)\r\n                       )\r\n    | extend Case = \"Added users to secure links\"\r\n    | project TimeGenerated = now(), Case, Details;\r\nlet Alertguest_added = workspace(\"Deramalogic-Sentinel\").OfficeActivity \r\n    | where Operation == \"AddedToSecureLink\" \r\n    | where TargetUserOrGroupType == \"Guest\" \r\n    | where UserId has_any (UserUPN)\r\n    | summarize GuestsAdded = make_set(TargetUserOrGroupName) by UserId \r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           UserId,\r\n                           \"\\nGuestsAdded: \",\r\n                           tostring(GuestsAdded)\r\n                       )\r\n    | extend Case = \"Added guest user to secure link\"\r\n    | project TimeGenerated = now(), Case, Details;\r\nlet cloud_file_sharing_sites = dynamic([\r\n    \"box.com\", \"drive.google.com\", \"dropbox.com\", \"mega.io\", \"mediafire.com\", \r\n    \"pCloud.com\", \"sync.com\", \"zoho.com\", \"Tresorit.com\", \"nextcloud.com\", \r\n    \"spideroak.com\", \"onedrive.com\", \"we.tl\", \"sendspace.com\", \"hightail.com\", \r\n    \"icloud.com\", \"4shared.com\", \"rapidshare.com\", \"zippyshare.com\", \r\n    \"filefactory.com\", \"sugarsync.com\", \"transfernow.net\", \"sendgb.com\", \r\n    \"files.fm\", \"smash.com\", \"sharefile.com\", \"gofile.io\", \"uploadfiles.io\", \r\n    \"filemail.com\", \"transfer.pcloud.com\"\r\n    ]);\r\nlet Alertcloud_access = workspace(\"Deramalogic-Sentinel\").DeviceNetworkEvents \r\n    | where RemoteUrl in (cloud_file_sharing_sites) \r\n    | where InitiatingProcessAccountUpn has_any (UserUPN)\r\n    | summarize AccessedSites = make_set(RemoteUrl) by InitiatingProcessAccountUpn, DeviceName\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           InitiatingProcessAccountUpn,\r\n                           \"\\nDeviceName: \",\r\n                           DeviceName,\r\n                           \"\\nAccessedSites: \",\r\n                           tostring(AccessedSites)\r\n                       )\r\n    | extend Case = \"Accessed cloud file-sharing sites\"\r\n    | project TimeGenerated = now(), Case, Details;\r\nlet Alertexternal_emails = workspace(\"Deramalogic-Sentinel\").EmailEvents \r\n    | where SenderFromAddress has_any (UserUPN)\r\n    | where RecipientEmailAddress !contains \"dermalogica.com\" and RecipientEmailAddress !contains \"dermalogica\" \r\n    | summarize\r\n        RecipientEmails = make_set(RecipientEmailAddress),\r\n        EmailSubjects = make_set(Subject),\r\n        EmailCount = dcount(RecipientEmailAddress)\r\n        by SenderFromAddress \r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           SenderFromAddress,\r\n                           \"\\nRecipientEmails: \",\r\n                           tostring(RecipientEmails),\r\n                           \"\\nEmailSubjects: \",\r\n                           tostring(EmailSubjects),\r\n                           \"\\nEmailCount: \",\r\n                           tostring(EmailCount)\r\n                       )\r\n    | extend Case = \"Sent emails to external recipients\"\r\n    | project TimeGenerated = now(), Case, Details;\r\nlet AlertSessionsRevoke = \r\n    workspace(\"Deramalogic-Sentinel\").AuditLogs\r\n    | where OperationName has 'StsRefreshTokenValidFrom'\r\n    | where TargetResources[0].modifiedProperties != '[]'\r\n    | where TargetResources[0].modifiedProperties !has 'DirectorySync'\r\n    | extend TargetResourcesModProps = TargetResources[0].modifiedProperties\r\n    | mv-expand TargetResourcesModProps\r\n    | where tostring(TargetResourcesModProps.displayName) =~ 'StsRefreshTokensValidFrom'\r\n    | extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))\r\n    | where InitiatingUserOrApp !in ('Microsoft Cloud App Security')\r\n    | extend targetUserOrApp = TargetResources[0].userPrincipalName\r\n    | extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))\r\n    | extend\r\n        AccountCustomEntity = InitiatingUserOrApp,\r\n        IPCustomEntity = InitiatingIpAddress\r\n    | where AccountCustomEntity has_any (UserUPN)\r\n    | project TimeGenerated, AccountCustomEntity, IPCustomEntity, targetUserOrApp\r\n    | extend Details = strcat(\r\n                           \"\\nUserUPN: \",\r\n                           AccountCustomEntity,\r\n                           \"\\nTargetUser: \",\r\n                           targetUserOrApp,\r\n                           \"\\nIPAddress: \",\r\n                           IPCustomEntity\r\n                       )\r\n    | extend Case = \"Revoke Sessions\"\r\n    | project TimeGenerated, Case, Details;\r\nlet AlertMailItemAccess = \r\n    workspace(\"Deramalogic-Sentinel\").CloudAppEvents\r\n    | where ActionType contains \"MailItemsAccessed\"\r\n    | where tostring(RawEventData.MailboxOwnerUPN) != tostring(RawEventData.UserId)\r\n    | extend\r\n        MailboxOwner =  tostring(RawEventData.MailboxOwnerUPN),\r\n        Actor = tostring(RawEventData.UserId),\r\n        InternetMessageId = tostring(parse_json(tostring(parse_json(tostring(RawEventData.Folders))[0].FolderItems))[0].InternetMessageId)\r\n    | where isnotempty(InternetMessageId)\r\n    | join kind=inner (workspace(\"Deramalogic-Sentinel\").EmailEvents\r\n        | project InternetMessageId, Subject, SenderFromAddress, To, Cc, DistributionList)\r\n        on InternetMessageId\r\n    | project\r\n        TimeGenerated,\r\n        ActionType,\r\n        Actor,\r\n        MailboxOwner,\r\n        Subject,\r\n        SenderFromAddress,\r\n        To,\r\n        Cc,\r\n        DistributionList\r\n    | where Actor has_any (UserUPN)\r\n    | extend Details = strcat(\r\n                           \"\\nActor: \",\r\n                           tostring(Actor),\r\n                           \"\\nMailboxOwner: \",\r\n                           tostring(MailboxOwner),\r\n                           \"\\nSubject: \",\r\n                           Subject,\r\n                           \"\\nSenderFromAddress: \",\r\n                           SenderFromAddress,\r\n                           \"\\nTo: \",\r\n                           tostring(To),\r\n                           \"\\nCc: \",\r\n                           tostring(Cc),\r\n                           \"\\nDistributionList: \",\r\n                           tostring(DistributionList)\r\n                       )\r\n    | extend Case = \"MailItemAccess of another mailbox\"\r\n    | project TimeGenerated, Case, Details;\r\nlet AlertAzureActivity = \r\n    workspace(\"Deramalogic-Sentinel\").AzureActivity\r\n    | where Caller has_any (UserUPN)\r\n    | project\r\n        TimeGenerated,\r\n        OperationNameValue,\r\n        ActivityStatusValue,\r\n        SubscriptionId,\r\n        ResourceGroup,\r\n        Caller,\r\n        CallerIpAddress,\r\n        Properties_d\r\n    | extend Details = strcat(\r\n                           \"\\nCaller: \",\r\n                           Caller,\r\n                           \"\\nOperationName: \",\r\n                           OperationNameValue,\r\n                           \"\\nActivityStatusValue: \",\r\n                           ActivityStatusValue,\r\n                           \"\\nSubscriptionId: \",\r\n                           SubscriptionId,\r\n                           \"\\nResourceGroup: \",\r\n                           ResourceGroup,\r\n                           \"\\nCallerIpAddress: \",\r\n                           CallerIpAddress,\r\n                           \"\\nProperties: \",\r\n                           tostring(Properties_d)\r\n                       )\r\n    | extend Case = \"Azure Activity\"\r\n    | project TimeGenerated, Case, Details;\r\nlet FinalTable = union \r\n        AlertAzureActivity,\r\n        AlertMailItemAccess,\r\n        AlertSessionsRevoke,\r\n        Alertexternal_emails,\r\n        Alertcloud_access,\r\n        Alertguest_added,\r\n        Alertadded_users_to_links,\r\n        Alertsecure_link_creation,\r\n        AlertFileDownload,\r\n        AlertMassDeletion,\r\n        AlertSigninlogs,\r\n        AlertOfficeOperations;\r\nFinalTable\r\n| project-reorder Case, TimeGenerated",
                                             "queryFrequency":  "PT12H",
                                             "queryPeriod":  "PT12H",
                                             "triggerOperator":  "GreaterThan",
                                             "triggerThreshold":  0,
                                             "suppressionDuration":  "PT5H",
                                             "suppressionEnabled":  false,
                                             "startTimeUtc":  "2025-08-16T05:30:00.000Z",
                                             "tactics":  [

                                                         ],
                                             "techniques":  [

                                                            ],
                                             "subTechniques":  [

                                                               ],
                                             "alertRuleTemplateName":  null,
                                             "incidentConfiguration":  {
                                                                           "createIncident":  true,
                                                                           "groupingConfiguration":  {
                                                                                                         "enabled":  false,
                                                                                                         "reopenClosedIncident":  false,
                                                                                                         "lookbackDuration":  "PT5H",
                                                                                                         "matchingMethod":  "AllEntities",
                                                                                                         "groupByEntities":  [

                                                                                                                             ],
                                                                                                         "groupByAlertDetails":  [

                                                                                                                                 ],
                                                                                                         "groupByCustomDetails":  [

                                                                                                                                  ]
                                                                                                     }
                                                                       },
                                             "eventGroupingSettings":  {
                                                                           "aggregationKind":  "SingleAlert"
                                                                       },
                                             "alertDetailsOverride":  null,
                                             "customDetails":  null,
                                             "entityMappings":  null,
                                             "sentinelEntitiesMappings":  null,
                                             "templateVersion":  null
                                         }
                      }
                  ],
    "parameters":  {
                       "workspace":  {
                                         "type":  "String"
                                     }
                   }
}